{
  "active_lock_reason": null,
  "assignee": null,
  "assignees": [],
  "author_association": "MEMBER",
  "body": "## Problem Statement\r\n\r\nIn order to support migration from legacy databases that may not have GTID turned on, there is a need for VReplication to support file:position based tracking.\r\n\r\nIt is understood that this type of tracking will work only for a single physical mysql source. Replication cannot be automatically resumed from a different source. In the worst case, it is possible to manually figure out the continuation point, and change the VReplication parameters to resume replication from a different source.\r\n\r\nSupporting file:position based vreplication will allow for one-time \"shoveling\" of data from an existing source to a destination. It could also be used to continuously keep the target data up-to-date just like we do for resharding. In this situation, it should also be possible to reverse the replication after a cut-over from legacy to vitess. This will give us the option to rollback a migration should anything go wrong.\r\n\r\n## Requirements\r\n\r\nThe VReplication design is entrenched in using the concept of GTID. So, it will be substantial work to change its DNA to recognize file:position based binlog tracking. However, Vitess has the design elements needed to support multiple GTID formats. This means that we can build a low level abstraction layer that encapsulates a file:position as a GTID. There are situations where this abstraction breaks down. We'll have to handle those corner cases.\r\n\r\n### Forcing file:position based tracking\r\n\r\nAlthough not anticipated, it's possible that a user may want to use file:position based tracking even if the source has GTID turned on. This means that file:position based tracking should not be inferred through auto-detection.\r\n\r\nAn environment variable (like MYSQL_FLAVOR) should not be used because the tracking mode depends on a specific source. Since VReplication can have multiple sources, this should be dictated by the source.\r\n\r\n### Current position\r\n\r\nIn GTID mode, the current position is guaranteed to be at a transaction boundary. But a file:position based binlog can report a position for every event, including stray ones that are not material for replication. In such cases, the mechanism of getting the current position from the source and asking the target to stop at that position should work no matter what that position is.\r\n\r\n### Single Source\r\n\r\nAs mentioned above, only a fixed mysql instance will be supported as source.\r\n\r\n## Design\r\n\r\nA prototype work was done by PlanetScale for file:position based tracking. This was developed as an \"RDS\" flavor. This is because RDS did not support GTIDs when this was developed. With PlanetScale's permission, this work will be leveraged to implement the new proposal. The work will be published as part of the Vitess license. The following high level tasks will need to be performed.\r\n\r\n* **Rename rdsFlavor->filePosFlavor**: This rename will more accurately represent the functionality.\r\n* **Flavor as connection parameter**: Since we need to control the flavor on a per-source basis, the best way to achieve this is to extend the `ConnParams` structure to include a `Flavor`. If empty, auto-detection will be used. If specified, the name will map to a registered flavor implementation. This approach will retain backward compatibility.\r\n* **Track sub-flavor**: Since we want to support file:position based tracking even if GTID is turned on, we need the ability to recognize GTID events. This means that we have to understand MySQL and MariaDB flavors under the covers.\r\n* **Standardize on when to send GTID**: Currently, the binlog dictates when to report a GTID. In some cases, it's before the next transaction, and sometimes it's within. We'll change the design to report the GTID just before the \"COMMIT\". This is the point where it's actually useful. Knowing exactly when a GTID will be received will simplify the design of the vplayer.\r\n* **Introduce Pseudo-GTID**: In order to report positions outside of transaction boundaries, one possibility is to report them as pseudo-GTIDs. Although it's possible to convert them to fake empty transactions, it may be more readable to use a separate category.\r\n* **Stop Position**: The vplayer currently uses ambiguous rules about how it handles the case where a stop position was exceeded. As part of this change, we'll standardize on: _A stop position is considered to be successfully reached if the new position is greater than or equal to the specified position_. The main motivation for this change is that the possibility of position mismatch is higher in the case of file:pos tracking. We're likely to hit many false positives if we're too strict.\r\n\r\n## Future improvements\r\n\r\nOnce a GTID gets more implicitly associated with saveable events, we can later deprecate GTID as an explicit event. Instead, we can send the GTID as part of the COMMIT or DDL message, which is where it's actually used. This will allow us to tighten some code in vplayer. Without this, the association of GTID with a COMMIT is more ambiguous, and there's extra code to glue them together.",
  "closed_at": "2019-11-23T00:39:06Z",
  "closed_by": {
    "avatar_url": "https://avatars3.githubusercontent.com/u/24160?v=4",
    "events_url": "https://api.github.com/users/rafael/events{/privacy}",
    "followers_url": "https://api.github.com/users/rafael/followers",
    "following_url": "https://api.github.com/users/rafael/following{/other_user}",
    "gists_url": "https://api.github.com/users/rafael/gists{/gist_id}",
    "gravatar_id": "",
    "html_url": "https://github.com/rafael",
    "id": 24160,
    "login": "rafael",
    "node_id": "MDQ6VXNlcjI0MTYw",
    "organizations_url": "https://api.github.com/users/rafael/orgs",
    "received_events_url": "https://api.github.com/users/rafael/received_events",
    "repos_url": "https://api.github.com/users/rafael/repos",
    "site_admin": false,
    "starred_url": "https://api.github.com/users/rafael/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/rafael/subscriptions",
    "type": "User",
    "url": "https://api.github.com/users/rafael"
  },
  "comments": 1,
  "comments_url": "https://api.github.com/repos/vitessio/vitess/issues/5424/comments",
  "created_at": "2019-11-11T01:00:43Z",
  "events_url": "https://api.github.com/repos/vitessio/vitess/issues/5424/events",
  "html_url": "https://github.com/vitessio/vitess/issues/5424",
  "id": 520688268,
  "labels": [
    {
      "color": "254387",
      "default": false,
      "description": "Logical improvement (somewhere between a bug and feature)",
      "id": 1638232724,
      "name": "Type: Enhancement",
      "node_id": "MDU6TGFiZWwxNjM4MjMyNzI0",
      "url": "https://api.github.com/repos/vitessio/vitess/labels/Type:%20Enhancement"
    }
  ],
  "labels_url": "https://api.github.com/repos/vitessio/vitess/issues/5424/labels{/name}",
  "locked": false,
  "milestone": null,
  "node_id": "MDU6SXNzdWU1MjA2ODgyNjg=",
  "number": 5424,
  "performed_via_github_app": null,
  "repository_url": "https://api.github.com/repos/vitessio/vitess",
  "state": "closed",
  "title": "RFC: File:Position based VReplication",
  "updated_at": "2019-11-23T00:39:06Z",
  "url": "https://api.github.com/repos/vitessio/vitess/issues/5424",
  "user": {
    "avatar_url": "https://avatars1.githubusercontent.com/u/589370?v=4",
    "events_url": "https://api.github.com/users/sougou/events{/privacy}",
    "followers_url": "https://api.github.com/users/sougou/followers",
    "following_url": "https://api.github.com/users/sougou/following{/other_user}",
    "gists_url": "https://api.github.com/users/sougou/gists{/gist_id}",
    "gravatar_id": "",
    "html_url": "https://github.com/sougou",
    "id": 589370,
    "login": "sougou",
    "node_id": "MDQ6VXNlcjU4OTM3MA==",
    "organizations_url": "https://api.github.com/users/sougou/orgs",
    "received_events_url": "https://api.github.com/users/sougou/received_events",
    "repos_url": "https://api.github.com/users/sougou/repos",
    "site_admin": false,
    "starred_url": "https://api.github.com/users/sougou/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/sougou/subscriptions",
    "type": "User",
    "url": "https://api.github.com/users/sougou"
  }
}